// FizzBuzz
// Одна з найпопулярніших на співбесідах завдань.
// Постановка
//         Потрібно написати функцію, що виводить у консоль числа
//         від 1 до n, де n - це ціле число,
//         яка функція приймає як параметр, з такими умовами:

// виведення fizz замість чисел, кратних 3;
// виведення buzz замість чисел, кратних 5;
// виведення fizzbuzz замість чисел, кратних як 3, і 5.
// приклад
// Fizzbuzz(5) => Результат
// // 1
// // 2
// // fizz
// // 4
// // buzz

// Розбираємо завдання
//         Головне тут – спосіб пошуку кратних чисел з використанням JavaScript.
//         Його можна реалізувати за допомогою оператора модуля або залишку - %,
//         який дозволяє показати залишок при розподілі двох чисел.Якщо залишок 0,
//         це означає, що перше число кратне другому.

// 12 % 5 // 2 -> 12 is not a multiple of 5
// 12 % 3 // 0 -> 12 is multiple of 3

//         Так, якщо розділити 12 на 5, отримуємо 2 із залишком 2.
//         Якщо ж розділити 12 на 3, то отримуємо 4 із залишком 0.
//         У першому випадку 12 не кратно 5, у другому - 12 кратно 3.

// Рішення
//         Оптимальним рішенням буде наступний код:

const fizzbuzz = num => {
    for (let i = 1; i <= num; i++) {
        if (i % 3 === 0 && i % 5 === 0) {
            console.log("fizzbuzz")
        }
        else if (i % 3 === 0) {
            console.log ("fizz")
        }
        else if (i % 5 === 0) {
            console.log("buzz")
        }
        else {
            console.log(i)
        }
    }
    
}
console.log ("sjgosijg[aeroijg")