// https://medium.com/webbdev/js-2b0820b3788f

// Паліндром
// Паліндром - слово, речення чи послідовність символів,
//             яка абсолютно однаково читається як у звичному напрямку,
//             так і у зворотному.Наприклад, "Anna" - це паліндром, а "table" і "John" - ні.

// Постановка
//             Дано рядок; потрібно написати функцію, яка дозволяє повернути значення true,
//             якщо рядок є паліндромом, і false - якщо ні.
//             При цьому потрібно враховувати прогалини та розділові знаки.


// Розбираємо завдання
//             Основна ідея тут – перевернути рядок у зворотному напрямку.
//             Якщо "реверсний" рядок повністю ідентичний вихідному, значить, ми отримали паліндром і функція повинна повернути значення true.Якщо ж ні – false.

// Рішення
//             Ось код, що дозволяє вирішити паліндром.

const palindrome = srt => {
   //1 Претворюємо у нижній регістр
    //2 з рядка робимо масив
    //3 робимо реверс масиву
    str = str.toLowerCase()
    return srt === str.split("").reverse().join("")
}
